const questions = [
  {
    question: "Сколько раз Стив Дэвис выигрывал Чемпионат мира по снукеру?",
		answers: [
      "4",
      "5",
      "6",
      "7",
    ],
		correct: 3,
  },
  {
    question: "Кто из игроков имеет прозвище \"Пистолет\"?",
		answers: [
      "Бен Вулластон",
      "Марк Аллен",
      "Люка Бресель",
      "Джек Лисовски",
    ],
		correct: 2,
  },
  {
    question: "Кому впервые покорилась отметка в 1000 сотенных серий в карьере?",
		answers: [
      "Джадд Трамп",
      "Джон Хиггинс",
      "Андрес Петров",
      "Ронни О'Салливан",
    ],
		correct: 4,
  },
  {
    question: "Какой крупный снукерный турнир проходит в легендарном Alexandra Palace?",
		answers: [
      "Чемпионат Британии",
      "Чемпионат мира",
      "Masters",
      "German Masters",
    ],
		correct: 3,
  },
  {
    question: "В какой стране зародился снукер?",
		answers: [
      "Индия",
      "Египет",
      "Англия",
      "Беларусь",
    ],
		correct: 1,
  },
  {
    question: "На каком турнире был сделан первый максимум?",
		answers: [
      "Чемпионат мира",
      "Премьер Лига",
      "Lada Classic",
      "Strachan Open",
    ],
		correct: 3,
  },
  {
    question: "За какой футбольный клуб болеет Нил Робертсон?",
		answers: [
      "Манчестер Сити",
      "Челси",
      "Спартак",
      "Арсенал",
    ],
		correct: 2,
  },
  {
    question: "Какое прозвище носит рефери Ян Верхаас?",
		answers: [
      "Летучий голландец",
      "Мистер Бин",
      "Всемогущий",
      "Джеймс Бонд",
    ],
		correct: 4,
  },
  {
    question: "Русский голос снукера?",
		answers: [
      "Володимир Сорокин",
      "Владислав Синичкин",
      "Борис Скворцов",
      "Владимир Синицын",
    ],
		correct: 4,
  },
  {
    question: "Игрок, доминировавший в снукере в 90-х годах?",
		answers: [
      "Стив Дэвис",
      "Джон Пэррот",
      "Стивен Хендри",
      "Ронни О'Салливан",
    ],
		correct: 3,
  },
  {
    question: "В 1979 году Терри Гриффитс стал первым чемпионом мира, который попал на тот чемпионат через квалификацию. Кто спустя много лет повторил это достижение?",
		answers: [
      "Марк Селби",
      "Грэм Дотт",
      "Шон Мерфи",
      "Стюарт Бинхэм",
    ],
		correct: 3,
  },
  {
    question: "Первый игрок, который смог сделать максимум на Чемпионате мира?",
		answers: [
      "Рэй Риардон",
      "Клифф Торбурн",
      "Стив Дэвис",
      "Алекс Хиггинс",
    ],
		correct: 2,
  },
  {
    question: "Кто из знаменитых игроков выступил в Крусибле в 1987 году последний раз в карьере?",
		answers: [
      "Рэй Риардон",
      "Дуг Маунтджой",
      "Вилли Торн",
      "Фред Дэвис",
    ],
		correct: 1,
  },
  {
    question: "Сколько лет было Стивену Хендри, когда он стал самым молодым чемпионом мира среди профессионалов в 1990 году?",
		answers: [
      "19",
      "20",
      "21",
      "22",
    ],
		correct: 3,
  },
  {
    question: "Из какой страны бывший профессиональный игрок в снукер Тони Драго?",
		answers: [
      "Италия",
      "Ирландия",
      "Туркменистан",
      "Мальта",
    ],
		correct: 4,
  },
  {
    question: "Какой игрок был первым в мировом рейтинге с мая 1975 по апрель 1981 года?",
		answers: [
      "Стив Дэвис",
      "Рэй Риардон",
      "Алекс Хиггинс",
      "Фред Дэвис",
    ],
		correct: 2,
  },
  {
    question: "В каком году впервые прошел Чемпионат мира по снукеру в театре \"Крусибл\"?",
		answers: [
      "1976",
      "1977",
      "1978",
      "1979",
    ],
		correct: 2,
  },
  {
    question: "Сколько раз финал Чемпионата мира заканчивался в решающем фрейме с тех пор, как его стали проводить в Крусибле?",
		answers: [
      "3",
      "6",
      "12",
      "5",
    ],
		correct: 1,
  },
  {
    question: "Кто из чемпионов мира по снукеру также выигрывал Чемпионат мира по пулу-восьмерке?",
		answers: [
      "Люка Бресель",
      "Стивен Хендри",
      "Марк Селби",
      "Нил Робертсон",
    ],
		correct: 3,
  },
  {
    question: "Кто из современных профессиональных игроков подрабатывал таксистом в свободное от снукера время?",
		answers: [
      "Стивен Магуайр",
      "Янь Бинтао",
      "Дэвид Гилберт",
      "Гэри Уилсон",
    ],
		correct: 4,
  },
];
